
using Symbolics
@variables E ρ γ β mx my mz Hx Hy Hz

[0    0    1    0    0    0    0
(2*Hx*ρ*(Hy*my+Hz*mz)+mx*(ρ*(-γ*E+(γ-2)*Hy^2+(γ-2)*Hz^2)+2*(γ-1)*my^2+2*(γ-1)*mz^2)+2*(γ-1)*mx^3)/ρ^3    (γ*mx)/ρ    -((-γ*E*ρ+(γ-2)*Hy^2*ρ+(γ-2)*Hz^2*ρ+3*(γ-1)*mx^2+(γ-1)*my^2+(γ-1)*mz^2)/ρ^2)    -((2*(Hx*Hy*ρ+(γ-1)*mx*my))/ρ^2)    -((2*(Hx*Hz*ρ+(γ-1)*mx*mz))/ρ^2)    -((2*(Hx*my+(γ-2)*Hy*mx))/ρ)    -((2*(Hx*mz+(γ-2)*Hz*mx))/ρ)
((γ-3)*mx^2+(γ-1)*(my^2+mz^2))/(2*ρ^2)    (γ-1)/2    -(((γ-3)*mx)/ρ)    (my-γ*my)/ρ    (mz-γ*mz)/ρ    (γ-2)*(-Hy)    (γ-2)*(-Hz)
-((mx*my)/ρ^2)    0    my/ρ    mx/ρ    0    -Hx    0
-((mx*mz)/ρ^2)    0    mz/ρ    0    mx/ρ    0    -Hx
(Hx*my-Hy*mx)/ρ^2    0    Hy/ρ    -(Hx/ρ)    0    mx/ρ    0
(Hx*mz-Hz*mx)/ρ^2    0    Hz/ρ    0    -(Hx/ρ)    0    mx/ρ]
